; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 2.0.0
; Author: Barnaba, dmocha, Mirosław Żylewicz
;
; Updating translations:
;   Before updating a translation, please make sure you have the current development version of
;   	Universal Extractor by enabling the 'Install beta updates' option in preferences and searching
;   	for updates by clicking 'Check for Updates' in the help menu.
; 	Make sure to read the messages titled 'Breaking changes' - which can be found at
;		https://github.com/Bioruebe/UniExtract2/issues/2 - for a list of changes to already translated
;   	terms. Please compare the affected translations with the always up-to-date English language file
;		and edit them to reflect the changes.
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file. Simply delete the Homepage line if you don't have one. Credit
;		yourself in the ABOUT_INFO_LABEL term if you want to.
;	Save the file in Unicode format (UTF-16/UCS-2 Little Endian) and send it to the developers -
;		via Github: https://github.com/Bioruebe/UniExtract2/issues/2 or
;		per e-mail to the address listed at https://bioruebe.com/contact/
;
;	The following symbols have special meanings:
;	& 		  - when used in a GUI label or button, it precedes the letter that will be registered
;				as a hotkey. Each letter should only be used once per menu.
;	%name	  - will be replaced with 'Universal Extractor'
;	%n	 	  - indicates a newline character
;	%t	  	  - indicates a tab character
;	%1,%2,... - indicates a string variable that UniExtract will replace
;		The content of each %1,... variable is hardcoded into UniExtract.
;		The numbered variables' order can be switched to fit your language's word order
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Anuluj"
YES_BUT = "&Tak"
NO_BUT = "&Nie"
DELETE_BUT = "&Usuń"
COPY_BUT = "&Kopiuj"
BATCH_BUT = "&Kolejka"
SEND_BUT = "&Wyślij"
NEXT_BUT = "&Dalej >"
PREV_BUT = "< &Wstecz"
CLOSE_BUT = "&Zamknij"
EXIT_BUT = "&Wyjdź"
CONTINUE_BUT = "&Kontynuuj"
FINISH_BUT = "&Zakończ"
ALWAYS_BUT = "&Zawsze"
NEVER_BUT = "&Nigdy"
CHECKBOX_REMEMBER = "Zapamiętaj mój wybór"
CHECKBOX_DONT_ASK_AGAIN = "Nie pytaj ponownie"
MAIN_DEST_DIR_LABEL = "&Katalog docelowy:"
MAIN_FILE_LABEL = "&Archiwum/Instalator"
MAIN_DIRECTORY_LOCK = "Zablokuj"
MAIN_DIRECTORY_LOCK_TOOLTIP = "Wyłącza automatyczny wybór katalogu docelowego, aby wyodrębnić%nwiele plików do tego samego katalogu bez konieczności ponownego%nwybierania miejsca docelowego dla każdego z nich."
MENU_FILE_LABEL = "&Plik"
MENU_FILE_OPEN_LABEL = "&Otwórz..."
MENU_FILE_KEEP_OPEN_LABEL = "&Pozostaw %name otwarty"
MENU_FILE_SHOW_LABEL = "&Wyświetl kolejkę zadań"
MENU_FILE_CLEAR_LABEL = "Wy&czyść kolejkę zadań"
MENU_FILE_LOG_OPEN_LABEL = "Otwórz &najnowszy plik dziennika"
MENU_FILE_LOG_FOLDER_OPEN_LABEL = "Otwórz katalog &dziennika"
MENU_FILE_LOG_LABEL = "Usuń &pliki dziennika (%1)"
MENU_FILE_QUIT_LABEL = "&Zamknij"
MENU_EDIT_LABEL = "&Edycja"
MENU_EDIT_SILENT_MODE_LABEL = "&Tryb cichy"
MENU_EDIT_PASSWORD_LABEL = "&Lista haseł"
MENU_EDIT_CONTEXT_LABEL = "&Wpisy menu kontekstowego"
MENU_EDIT_PREFS_LABEL = "&Ustawienia"
MENU_HELP_LABEL = "&Pomoc"
MENU_HELP_FEEDBACK_LABEL = "&Przekaż opinię"
MENU_HELP_PLUGINS_LABEL = "&Menedżer wtyczek"
MENU_HELP_UPDATE_LABEL = "Sprawdź dostępność &aktualizacji"
MENU_HELP_WEB_LABEL = "&Strona internetowa %1"
MENU_HELP_GITHUB_LABEL = "%1 na &Github"
MENU_HELP_STATS_LABEL = "&Statystyki"
MENU_HELP_PROGDIR_LABEL = "Otwórz katalog pro&gramu"
MENU_HELP_CONFIGFILE_LABEL = "Otwórz plik &konfiguracyjny"
MENU_HELP_ABOUT_LABEL = "&O programie"
PREFS_TITLE_LABEL = "Ustawienia"
PREFS_UNIEXTRACT_OPTS_LABEL = "Opcje ogólne"
PREFS_HISTORY_LABEL = "Przechowuj &historię archiwów"
PREFS_UPDATEINTERVAL_LABEL = "Sprawdź aktualizacje:"
PREFS_UPDATE_DAILY = "Codziennie"
PREFS_UPDATE_WEEKLY = "Raz w tygodniu"
PREFS_UPDATE_MONTHLY = "Raz w miesiącu"
PREFS_UPDATE_YEARLY = "Raz w roku"
PREFS_UPDATE_NEVER = "Nigdy"
PREFS_UPDATE_CUSTOM = "Co %1 dni"
PREFS_FORMAT_OPTS_LABEL = "Opcje dodatkowe"
PREFS_LANG_LABEL = "&Język:"
PREFS_WARN_EXECUTE_LABEL = "&Ostrzegaj przed wykonaniem plików"
PREFS_WARN_EXECUTE_TOOLTIP = "Niektóre metody wypakowywania oparte są na wykonywaniu plików.%nGdy ta opcja jest włączona zostanie wyświetlone ostrzeżenie przed wykonaniem potencjalnie niebezpiecznego działania."
PREFS_CHECK_FREE_SPACE_LABEL = "Sprawdź ilość wolnego miejsca"
PREFS_CHECK_FREE_SPACE_TOOLTIP = "Przed wypakowywaniem sprawdź, czy na dysku jest wystarczająca ilość wolnego miejsca."
PREFS_CHECK_UNICODE_LABEL = "Sprawdź znaki Unicode"
PREFS_CHECK_UNICODE_TOOLTIP = "Niektóre znaki specjalne (np. znaki japońskie w systemach innych niż japoński) mogą powodować problemy podczas próby wypakowywania.%nJeśli wystąpią problemy z wypakowaniem takich plików, należy włączyć tę opcję, aby tymczasowo i automatycznie zmieniać ich nazwy."
PREFS_APPEND_EXT_LABEL = "&Napraw rozszerzenia plików"
PREFS_APPEND_EXT_TOOLTIP = "Naprawia brakujące lub nieprawidłowe rozszerzenia plików."
PREFS_HIDE_TRAY_LABEL = "Wyłącz ikonę na pasku zadań"
PREFS_HIDE_STATUS_LABEL = "Wyłącz pole stanu"
PREFS_HIDE_STATUS_FULLSCREEN_LABEL = "Ukryj pole stanu w trybie pełnoekranowym"
PREFS_HIDE_STATUS_FULLSCREEN_TOOLTIP = "Tryb gry - automatycznie wyłącza pole stanu, gdy aktywne jest okno aplikacji w trybie pełnoekranowym."
PREFS_OPEN_FOLDER_LABEL = "Otwórz folder po wypakowaniu"
PREFS_FEEDBACK_PROMPT_LABEL = "Pytaj o opinie"
PREFS_FEEDBACK_PROMPT_TOOLTIP = "Gdy ta opcja jest włączona po nieudanym wypakowaniu zostanie wyświetlony komunikat z prośbą o opinię."
PREFS_WINDOW_POSITION_LABEL = "Zapamiętaj rozmiar i położenie okna"
PREFS_SEND_STATS_LABEL = "Wysyłaj anonimowe statystyki"
PREFS_SEND_STATS_TOOLTIP = "Automatycznie wysyła statystyki (typy najczęściej wyodrębnianych plików - np. zip, jakie opcje masz włączone, losowy identyfikator%nużytkownika). Nie są zbierane nazwy plików ani informacje, które mogłyby zostać wykorzystane do identyfikacji użytkownika.%nPomaga to nam zidentyfikować najczęściej używane funkcje %name i skupić się na ich ulepszaniu."
PREFS_LOG_LABEL = "Utwórz pliki dziennika"
PREFS_VIDEOTRACK_LABEL = "Wypakuj ścieżki wideo"
PREFS_VIDEOTRACK_TOOLTIP = "Jeśli ta opcja jest wyłączona, ścieżki wideo będą ignorowane podczas wypakowywania plików wideo.%nJest to przydatne, gdy potrzebujesz tylko ścieżek audio oraz chcesz zaoszczędzić czas i miejsce na dysku."
PREFS_TOPMOST_LABEL = "Zawsze na &wierzchu"
PREFS_BETA_UPDATES_LABEL = "Instaluj aktualizacje do wersji beta"
PREFS_SOURCE_FILES_LABEL = "Pliki źródłowe"
PREFS_SOURCE_FILES_OPT_ASK = "Zapytaj"
PREFS_SOURCE_FILES_OPT_DELETE = "Usuń"
PREFS_SOURCE_FILES_OPT_KEEP = "Zachowaj"
PREFS_SOURCE_FILES_OPT_KEEP_TOOLTIP = "Zawsze wyświetli komunikat, czy usunąć lub zachować pliki źródłowe."
PREFS_DELETE_ADDITIONAL_FILES_LABEL = "Usuń dodatkowe pliki"
PREFS_DELETE_ADDITIONAL_FILES_TOOLTIP = "%name wstępnie filtruje wyodrębnione pliki i przenosi znane, bezużyteczne pliki do katalogu '%1'.%nTutaj możesz wybrać, czy chcesz usunąć te pliki."
FEEDBACK_TITLE_LABEL = "Opinia"
FEEDBACK_SYSINFO_LABEL = "Informacje o systemie:"
FEEDBACK_OUTPUT_LABEL = "Dane wyjściowe %name:"
FEEDBACK_MESSAGE_LABEL = "Twoja wiadomość/dodatkowe informacje:"
FEEDBACK_PRIVACY_ACCEPT_LABEL = "Przeczytałem i akceptuję politykę prywatności"
FEEDBACK_PRIVACY_VIEW_LABEL = "Zobacz politykę prywatności"
CONTEXT_ENTRIES_LABEL = "Wpisy menu kontekstowego"
CONTEXT_ENABLED_LABEL = "Włączone"
CONTEXT_ALL_USERS_LABEL = "Aktywuj dla wszystkich użytkowników"
CONTEXT_ADMIN_REQUIRED = "Ta opcja wymaga uprawnień administratora"
CONTEXT_FILE_ASSOC_LABEL = "Skojarzenia plików"
CONTEXT_SIMPLE_RADIO = "Menu proste"
CONTEXT_CASCADING_RADIO = "Menu kaskadowe"
CONTEXT_CASCADING_RADIO_TOOLTIP = "Ta funkcja wymaga systemu Windows 7 lub nowszego"
UPDATE_ACTION_INSTALL = "Zainstaluj aktualizację"
UPDATE_STATUS_SEARCHING = "Wyszukiwanie aktualizacji..."
UPDATE_TERM_PROGRAM_FILES = "Pliki programu %name"
UPDATE_WHATS_NEW = "Co nowego?"
FIRSTSTART_TITLE = "Asystent &pierwszego uruchomienia"
FIRSTSTART_PAGES = "Witamy|Ustawienia|Wpisy menu kontekstowego"
FIRSTSTART_PAGE1 = "Witamy w %name.%n%nPoświęć chwilę, aby dopasować %name do swoich potrzeb.%n%nNa początek kwestie prawne.%nTo oprogramowanie dostarczane jest w stanie „tak jak jest”, bez żadnych gwarancji. Korzystasz z niego na własne ryzyko. Autorzy %name nie ponoszą odpowiedzialności za szkody poniesione przez użytkownika w rezultacie korzystania z programu. Korzystając z %name wyrażasz zgodę na używanie go wyłącznie do celów zgodnych z prawem lokalnym oraz międzynarodowym. Jeśli nie akceptujesz tej umowy, nie możesz korzystać z tego narzędzia."
FIRSTSTART_PAGE2 = "Teraz skonfiguruj ogólne opcje wyodrębniania i globalne zachowania %name.%n%nDostęp do wszystkich ustawień można uzyskać w dowolnym momencie z poziomu menu głównego programu."
FIRSTSTART_PAGE3 = "%name może być w pełni zintegrowana z menu kontekstowym, dzięki czemu po kliknięciu pliku prawym przyciskiem myszy masz możliwość rozpakowania pliku lub wyświetlenia informacji o typie pliku bez otwierania głównego okna programu. Określ, które pozycje menu kontekstowego powinny być wyświetlane.%n%nDostęp do wszystkich ustawień można uzyskać w dowolnym momencie z poziomu menu głównego programu."
FFMPEG_LICENSE_ACCEPT_LABEL = "Przeczytałem i akceptuję umowę licencyjną"
FFMPEG_LICENSE_VIEW_LABEL = "Wyświetl umowę licencyjną"
FFMPEG_SELECT_LABEL = "Masz już FFmpeg?"
FFMPEG_SELECT_TITLE = "Wybierz FFmpeg"
STATS_HEADER_STATUS = "Ogólny rozkład wyników"
STATS_HEADER_TYPE = "Wypakowywane typy plików"
STATS_STATUS_SUCCESS = "Sukces"
STATS_STATUS_FAILED = "Porażka"
STATS_STATUS_FILEINFO = "Skan pliku"
STATS_STATUS_UNKNOWN = "Nieznany lub nieobsługiwany typ pliku"
STATS_NO_DATA = "Za mało danych, aby utworzyć statystyki.%n%nSpróbuj ponownie później."
FILESCAN_TITLE = "Wynik skanowania pliku:"
ABOUT_INFO_LABEL = "Oryginalna wersja od %1%nWersja 2.0.0 od Bioruebe <%2>%nWersja %3 od gvp9000%n%nPolskie tłumaczenie Barnaba, Mirosław Żylewicz%n%nWydany na licencji %4"
ABOUT_VERSION = "Wersja %1 (%2)"
METHOD_ADMIN_RADIO = "Instalator administracyjny %1"
METHOD_EXTRACTION_RADIO = "Wypakowywanie %1"
METHOD_HEADER = "Wypakowywanie %1"
METHOD_RADIO_LABEL = "Metoda wypakowywania"
METHOD_SWITCH_RADIO = "Przełącz %1"
METHOD_NOT_INSTALLER_RADIO = ""
METHOD_TEXT_LABEL = "%name obsługuje następujące metody wypakowywania %1. Niestety, żadna z tych metod nie jest w 100% niezawodna. Jeśli domyślna metoda nie działa, uruchom ponownie %name i wybierz alternatywną metodę."
METHOD_UNPACKER_RADIO = "Rozpakowywanie %1"
METHOD_GAME_LABEL = "Plik %1 jest prawdopodobnie archiwum gry. %name może obsługiwać kilka typów pakietów gier, ale nie może określić, z której gry pochodzi plik. Jeśli plik należy do gry, wybierz go z poniższej listy. W przeciwnym razie wybierz '%2' lub kliknij '%3', aby spróbować wypakować pakiet za pomocą innej metody."
METHOD_GAME_NOGAME = "Brak gry na liście"
METHOD_NOT_IN_LIST = "Żadna z powyższych"
METHOD_FILE_SELECT_LABEL = "Potrzebny jest dodatkowy plik danych, aby wypakować %1, ale %name nie może go ustalić.%n%nWybierz jedną z poniższych opcji. Jeśli wypakowanie nie działa poprawnie, spróbuj ponownie dokonując innego wyboru."
METHOD_EXTRACTOR_SELECT_LABEL = "%nPoniższa lista zawiera krótki kod każdego programu wypakowującego/typ pliku obecnie obsługiwanego przez %name.%n%nWybierz typ wypakowywania, którego chcesz użyć. Wybierz '%2', aby automatycznie wykryć typ pliku, jakby normalnie uruchamiał go %name."

; GUI control functions
EXTRACT_TO = "Wypakuj do"
OPEN_FILE = "Otwórz plik"
SELECT_FILE = "Wybierz plik"
UPDATE_CURRENT = "Korzystasz z najnowszej wersji %name."

; Common terms
TERM_ARCHIVE = "archiwum"
TERM_AUDIO = "Audio"
TERM_COMPILED = "Skompilowany"
TERM_COMPRESSED = "skompresowany plik"
TERM_CONTAINER = "format kontenera"
TERM_DATABASE = "baza danych"
TERM_DISK_IMAGE = "obraz dysku"
TERM_DOWNLOAD = "Pobierz"
TERM_DOWNLOADING = "Pobieranie"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "zakodowany plik"
TERM_ENCRYPTED = "zaszyfrowany plik"
TERM_ERROR = "Błąd"
TERM_EXECUTABLE = "plik wykonywalny"
TERM_EXTRACT = "Wypakuj"
TERM_FILE = "plik"
TERM_GAME = "Gra "
TERM_HELP = "Plik pomocy"
TERM_HOTFIX = "błyskawiczna łatka"
TERM_IMAGE = "obraz"
TERM_INSTALLED = "Zainstalowany"
TERM_INSTALLER = "instalator"
TERM_LOADING = "Ładowanie..."
TERM_MERGE_MODULE = "moduł scalania"
TERM_OVERALL_PROGRESS = "Ogólny postęp"
TERM_PACKAGE = "spakowany"
TERM_PAGE = "strona"
TERM_PATCH = "łatka"
TERM_RECONSTRUCTED = "Zrekonstruowany"
TERM_SCAN = "Skanuj"
TERM_SCRIPT = "skrypt"
TERM_SFX = "Samorozpakowujący"
TERM_STAGE = "Etap"
TERM_TESTING = "Testowanie pliku za pomocą"
TERM_TRANSLATION = "tłumaczenie"
TERM_UNKNOWN = "nieznany"
TERM_UNPACKED = "wypakowany"
TERM_UPDATER = "aktualizator"
TERM_VIDEO = "Wideo"

; Status messages
SCANNING_FILE = "Skanowanie pliku za pomocą %1"
SCANNING_EXE = "Skanowanie pliku wykonywalnego za pomocą %1"
EXTRACTING = "Wypakowywanie plików za pomocą:"
INIT_WAIT = "Oczekiwanie na uruchomienie instalatora.%nProszę czekać."
SENDING_FEEDBACK = "Wysyłanie opinii"
INPUT_NEEDED = "Wymagana interwencja użytkownika"
SEARCHING_PASSWORD = "Wyszukiwanie hasła"
TESTING_PASSWORD = "Sprawdzanie haseł (%1/%2)"
MOVING_FILE = "Przenoszenie do"
RENAMING_FILES = "Zmiana nazw plików"
RENAMING_FILES_PROGRESS = "Zmiana nazw plików (%1/%2)"
PROCESSING = "Przetwarzanie..."
CLEANING_UP = "Czyszczenie..."

; Custom prompts
INIT_COMPLETE = "Inicjalizacja zakończona. Wyjdź z instalatora, a następnie kliknij OK, aby kontynuować."
UNPACK_PROMPT = "Ten plik może być spakowany za pomocą kompresji %1.%n%nCzy chcesz go rozpakować?%nJeśli nie, analiza pliku będzie kontynuowana.%n%nUwaga: Rozpakowany plik będzie miał nazwę:%n%2"
UNPACK_FAILED = "Błąd: %1%nnie mógł zostać rozpakowany."
UNPACK_AGAIN = "%1 został pomyślnie rozpakowany. %n%nCzy chcesz, aby %name spróbował wypakować plik %2?"
NSIS_BINFILES = "Uwaga: %1 został pomyślnie wypakowany. %nJednakże istnieją pliki data.bin w tym samym katalogu co plik %2. Mogą to być części plików instalacyjnych. %n%nKliknij OK, aby %name rozpakował je lub Anuluj, aby przerwać."
WARN_EXECUTE = "Aby wypakować pliki tego typu, plik musi zostać bezpośrednio uruchomiony.%n%nJeśli uważasz, że ten plik może zawierać złośliwe oprogramowanie, zaleca się anulowanie tej akcji."
FEEDBACK_SUCCESS = "Dziękujemy za opinię. Twoja wiadomość zostanie wkrótce przetworzona."
FEEDBACK_PROMPT = "Aby poprawić kolejne wersje %name, możesz poinformować programistów o napotkanych problemach.%nDzienniki wypakowywania zawierają cenne informacje o pliku i potencjalnych błędach, które mogły wystąpić podczas wypakowywania.%n%nCzy otworzyć teraz interfejs przekazywania opinii?"
FEEDBACK_PRIVACY = "Ochrona danych osobowych: Pliki opinii są przechowywane na naszych serwerach online, dopóki nie zostaną przetworzone przez dewelopera, a następnie są usuwane. Dane nie są udostępniane osobom trzecim. Można w dowolnym momencie zażądać ich usunięcia poprzez e-mail.%n%nRejestrowana zawartość może zawierać informacje o systemie, jak również części zawartości pliku. Jeśli nie chcesz wysłać określonych informacji, wystarczy je usunąć.%n%nCzy akceptujesz tę umowę o ochronie prywatności i chcesz wysłać wiadomość? W przeciwnym razie nic nie zostanie wysłane."
FEEDBACK_OUTDATED = "Ostrzeżenie: Używasz przestarzałej wersji %name.%n%nPrzed zgłoszeniem problemu upewnij się, że posiadasz najnowszą wersję programu. Dziękujemy!"
FFMPEG_NEEDED = "%1 wydaje się być plikiem multimedialnym.%n%nW celu wyodrębnienia wszystkich ścieżek audio i wideo, potrzebny jest FFmpeg. Wystarczy kliknąć przycisk %2, a wszystkie pliki zostaną pobrane i skonfigurowane automatycznie."
PROGRAM_FILES_MISSING = "Ostrzeżenie: Pliki programu %name są niekompletne.%n%nCzy chcesz automatycznie pobrać wszystkie brakujące pliki?"
PLUGIN_MISSING = "Aby wyodrębnić %1, potrzebny jest dodatkowy program pomocniczy.%n%nUżyj poniższego przycisku, aby otworzyć menedżera wtyczek i pobrać wybrany moduł pomocniczy. Następnie użyj przycisku '%2', aby dodać go do %name. Po zamknięciu menedżera wtyczek, kontynuuj wypakowywanie."
UPDATE_PROMPT = "Dostępna jest nowa aktualizacja %1.%n%nCzy chcesz ją teraz pobrać?"
FILE_COPY = "Aby poprawnie przetworzyć plik %1, musi zostać utworzona jego kopia. W zależności od rozmiaru pliku może to zająć trochę czasu.%n%nUpewnij się, że masz wystarczająco dużo wolnego miejsca i kliknąć przycisk OK, aby kontynuować."
FILE_DELETE = "Plik %1 został pomyślnie wypakowany. Czy chcesz, aby %name usunął oryginalny plik?%n%nUwaga: Może się zdarzyć, że wyodrębnione pliki nie są użyteczne. Kliknij Tak, jeśli masz pewność, że wypakowane pliki są prawidłowe.%n(Ten komunikat można wyłączyć w ustawieniach)"
BATCH_DUPLICATE = "Plik %1 znajduje się już w kolejce zadań.%n%nCzy plik ma być ponownie dodany i w związku z tym wypakowany dwukrotnie?"
NO_FREE_SPACE = "Ostrzeżenie:%nDysk wyjściowy %1 ma mniej wolnego miejsca niż rozmiar pliku wejściowego.%n%nWolne miejsce:%t%2 MB%nWymagane miejsce:%t>%3 MB%nRóżnica:%t~%4 MB"
CONTEXT_DANGEROUS = "Ostrzeżenie:%nZmiana skojarzeń plików może być niebezpieczna. Np. zmiana standardowych poleceń dla .exe może spowodować, że aplikacje nie będą w stanie działać w ogóle. Upewnij się, że wiesz, co robisz.%n%nCzy chcesz kontynuować?"
ELEVATION_REQUIRED = "Odmowa dostępu.%n%n%name zostanie teraz uruchomiony ponownie z podwyższonymi prawami. Spróbuj ponownie po tej operacji."
ACCESS_DENIED = "Odmowa dostępu.%n%n%name jest już uruchomiony z podwyższonymi uprawnieniami. Należy upewnić się, że masz uprawnienia niezbędne do wykonania działań i spróbować ponownie."
MOVE_FAILED = "%1 nie można skopiować do %2. W przypadku, gdy ścieżka lub nazwa zawiera znaki specjalne, należy spróbować zmienić nazwę pliku lub przenieść go do folderu o zwykłej nazwie. W ten sposób %name nie musi kopiować go do katalogu tymczasowego. Następnie ponownie rozpocznij ekstrakcję."

; Help text
HELP_TITLE = "%name: Sposób użycia wiersza poleceń"
HELP_USAGE_TITLE = "Sposób użycia:"
HELP_USAGE = "%1 <file> [<destination> | /scan | /sub | /last] [/silent] [/batch] [/type[=<type>]]"
HELP_ARGUMENTS = "Obsługiwane argumenty:"
HELP_SCAN = "%n   %1%t%tWyświetla informacje o typie pliku, nie wypakowuje żadnych plików"
HELP_FILENAME = "   <file>%t%tNazwa pliku do wypakowania"
HELP_DESTINATION = "%n   <destination>%tKatalog, do którego należy wypakować"
HELP_SILENT = "%n   %1%t%tTryb cichy (wyłącza wszystkie komunikaty)"
HELP_BATCH = "%n   %1%t%tDodaj plik do kolejki zadań"
HELP_TYPE = "%n   %1<type>%tTraktuje plik do wyodrębnienia jako <type>%n%t%t lub wyświetla okno wyboru, jeśli nie podano typu"
HELP_SUB = "%n%nParametr %1 spowoduje, że zamiast w docelowym katalogu, %name wypakuje pliki do podkatalogu o nazwie archiwum;"
HELP_LAST = "z %1 zostanie wykorzystany ostatnio użyty katalog."
HELP_NOARGS = "%n%n%name uruchomiony bez żadnych argumentów będzie prosił użytkownika o podanie nazwy pliku i katalog docelowy."
HELP_MORE = "%n%nPełną dokumentację zawierającą rzadziej używane parametry wiersza poleceń można znaleźć w pomocy online, do której łącze znajdziesz poniżej."
HELP_EXAMPLE_TITLE = "Przykład:"
HELP_EXAMPLE = "%1 "C:\Pliki\przykład.zip" "C:\rozpakowany""
HELP_DOCS_LINK = "Zobacz pełną dokumentację wiersza poleceń"

; Warning messages
WARN_CONVERSION_FAILED = "Automatyczna konwersja plików nie powiodła się."
WARN_MOVE_FAILED = "Nie udało się przenieść %1 plików/folderów."

; Error messages
UNKNOWN_FILETYPE_TITLE = "Nieznany typ pliku"
UNKNOWN_FILETYPE = "Nie można wypakować %1. Nie udało się określić typu pliku.%n%nJeśli posiadasz więcej informacji o tym typie pliku, skontaktuj się z nami za pomocą formularza opinii."
INVALID_FILE = "Plik do wypakowania,%n%n%1,%nnie został znaleziony. Proszę wybrać prawidłowe dane wejściowe.%n%n%1"
INVALID_DIR = "Nie można utworzyć %1. Być może nie masz wystarczających uprawnień do zapisu w folderze.%n%nProszę wybrać prawidłową lokalizację docelową lub spróbować uruchomić %name z prawami administratora."
NO_HISTORY = "Nie można wypakować %1.%nNie można odczytać ostatnio używanego katalogu.%n%nUpewnij się przed próbą wypakowania do ostatnio używanego katalogu, że %2 jest włączony i co najmniej jeden plik został wypakowany."
EXTRACT_FAILED = "Nie można wypakować %1.%n%nPlik wygląda na %2, który jest obsługiwany, ale wypakowanie nie powiodło się.%n%nCzy chcesz, aby %name utworzył i wyświetlił plik dziennika z dalszymi informacjami?"
NOT_PACKED = "Nie można wypakować %1, plik nie jest spakowany, ale %n%n%2"
DOWNLOAD_FAILED = "Nie można pobrać pliku %1. Upewnij się, że masz połączenie z internetem i spróbuj ponownie."
UPDATECHECK_FAILED = "Sprawdzanie dostępności aktualizacji nie powiodło się. Upewnij się, że masz połączenie z internetem i spróbuj ponownie."
UPDATE_FAILED = "Niektóre pliki nie zostały zaktualizowane.%n%nSpróbuj ponownie później, uruchom %name jako administrator lub pobierz ponownie %name."
UPDATE_NOADMIN = "%name nie mógł uzyskać uprawnień administracyjnych.%n%nKliknij prawym przyciskiem myszy ikonę %name i wybierz 'Uruchom jako administrator', a następnie ponownie wyszukaj aktualizacje za pomocą menu pomocy."
FFMPEG_MOVE_FAILED = "Nie można poprawnie skonfigurować FFmpeg. Kliknij prawym przyciskiem myszy ikonę programu %name i wybierz „Uruchom jako administrator”, aby spróbować ponownie."
FFMPEG_INVALID_FILE = "Wybrany plik nie jest obsługiwaną wersją FFmpeg.%n%nFFmpeg jest dostępny w dwóch wersjach: Jako pojedynczy duży plik wykonywalny ('statyczny') oraz jako folder z bardzo małym plikiem wykonywalnym i wieloma plikami .dll ('współużytkowany'). %name obsługuje tylko pierwszą wersję."
FEEDBACK_EMPTY = "Spróbuj podać jak najwięcej informacji, aby zapewnić szybką obsługę swojej opinii."
FEEDBACK_ERROR = "Nie udało się wysłać opinii. Spróbuj ponownie później lub prześlij swój raport pocztą elektroniczną lub na Github. Dziękujemy.%n%nWystąpił następujący błąd: %1"
FEEDBACK_PRIVACY_NOT_ACCETPED = "Zaakceptuj politykę prywatności, aby przesłać opinię."
LICENSE_NOT_ACCEPTED = "Proszę zaakceptować umowę licencyjną, aby kontynuować."
BATCH_FINISH = "Przetwarzanie kolejki zadań zostało zakończone, ale nie wszystkie pliki zostały wypakowane. Następujące pliki spowodowały błąd:%n%n%1%nAby uzyskać więcej informacji uważnie zapoznaj się z odpowiednimi plikami w katalogu dziennika (dostępne tylko, jeśli włączono rejestrowanie)."
NOT_SUPPORTED_TITLE = "Nieobsługiwany typ pliku"
NOT_SUPPORTED = "Nie można wypakować %1.%n%n%name nie obsługuje tego typu pliku.%n%nJeśli posiadasz informacje o tym, jak rozpakować plik, wyślij nam wiadomość i pomóż ulepszyć %name."
MISSING_EXE = "Nie można wypakować %1.%n%nNie można odnaleźć modułu pomocnika %2."
EXTRACT_TIMEOUT = "Nie można wypakować %1.%n%nOsiągnięto limit czasu. Jeśli problem jest tymczasowy, kolejna próba może doprowadzić do sukcesu."
WRONG_PASSWORD = "Nie można wypakować %1.%n%nPlik jest chroniony hasłem a wprowadzone hasło jest niepoprawne.%n%nWskazówka: Użyj wbudowanego automatycznego wyszukiwania haseł opartego o konfigurowalne listy haseł, które można znaleźć w menu %2."
NO_FREE_SPACE_ERROR = "Nie można wyodrębnić %1.%n%nNa dysku wyjściowym nie ma wystarczającej ilości miejsca. Zwolnij wystarczającą ilość miejsca i spróbuj ponownie."
MISSING_PART = "Nie można wyodrębnić %1.%n%nArchiwum składa się z wielu części. Wszystkie są niezbędne do wyodrębnienia zawartości, ale nie można znaleźć niektórych z nich.%n%nUpewnij się, że wszystkie części pliku znajdują się w tym samym katalogu i spróbuj ponownie."
PLUGIN_IMPORT_MISSINGFILES = "Importowanie wtyczki %1 nie powiodło się.%n%nNie zostały wybrane wszystkie pliki. Spróbuj ponownie i wybierz wszystkie z następujących plików:%n%n%2"
MISSING_DEFINITION = "Nie można wypakować %1.%n%nPlik definicji %2 nie mógł zostać odnaleziony.%n%nJeśli jest to niestandardowa wtyczka, upewnij się, że została skonfigurowana poprawnie."
OPEN_URL_FAILED = "%name nie może otworzyć żądanego adresu strony internetowej.%n%nProszę otworzyć przeglądarkę i ręcznie wprowadzić następujący adres URL:"

; Plugin descriptions
PLUGIN_SUPPORTED_FILETYPES = "Obsługiwane typy plików:"
PLUGIN_ARC_CONV = "Program wypakowujący kilka archiwów gier"
PLUGIN_ISCAB = "Część pakietu InstallShield służąca do wyodrębniania plików cab. Może działać lepiej niż Universal Extractor, ale jest to narzędzie komercyjne (płatne)."
PLUGIN_THINSTALL = "Program wypakowujący programy portable wykonane za pomocą Thinstall"
PLUGIN_UNREAL = "Program wypakowujący archiwa Unreal Engine"
PLUGIN_WINTERMUTE = "Program wypakowujący archiwa gier opartych na silniku WinterMute"
PLUGIN_CI = "Wtyczka dla instalatorów CreateInstall (pobierz, zainstaluj, kopiuj pliki %1, %2, %3 do \bin)"
PLUGIN_DGCA = "Dekompresor archiwów DGCA"
PLUGIN_BOOTIMG = "Program wypakowujący obrazy rozruchowe systemu Android"
PLUGIN_IS5COMP = "Program wypakowujący starsze archiwa Cabinet InstallShield"
PLUGIN_WOLF = "Dodatkowe narzędzie używane do wyodrębniania zaszyfrowanych archiwów gier WOLF RPG"
PLUGIN_EXTSIS = "Program wypakowujący nowsze pakiety systemu Symbian OS"
PLUGIN_BITROCK = "Program wypakowujący instalatory Bitrock Install Builder"

; Context Menu integration
EXTRACT_FILES = "&Otwórz w UniExtract"
EXTRACT_HERE = "UniExtract &tutaj"
EXTRACT_SUB = "UniExtract do po&dkatalogu"
EXTRACT_LAST = "UniExtract do &ost. katalogu"
SCAN_FILE = "&Skanuj plik"

; Other
DIR_ADDITIONAL_FILES = "Dodatkowe pliki"

; Uninstaller
UNINSTALL = "Odinstaluj"
UNINSTALL_TITLE = "Odinstaluj %name"
UNINSTALL_LABEL = "Jeśli planujesz ponownie zainstalować %name, warto zachować swoje ustawienia. Jeśli chcesz usunąć program na stałe, dane użytkownika można bez wahania usunąć."
UNINSTALL_REMOVE_LOGS = "Usuń pliki dziennika"
UNINSTALL_REMOVE_USERDATA = "Usuń wszystkie dane i ustawienia użytkownika"
